test/fixtures/GetInvoices-client.json

{
  "result": "success",
  "totalresults": 2,
  "startnumber": 0,
  "numreturned": 2,
  "invoices": {
    "invoice": [
      {
        "id": 5001,
        "userid": 42,
        "invoicenum": "5001",
        "date": "2026-01-01",
        "duedate": "2026-01-15",
        "datepaid": "0000-00-00 00:00:00",
        "total": "30.00",
        "status": "Unpaid",
        "paymentmethod": "stripe",
        "currencycode": "USD"
      },
      {
        "id": 5002,
        "userid": 42,
        "invoicenum": "5002",
        "date": "2025-12-01",
        "duedate": "2025-12-15",
        "datepaid": "2025-12-10 10:00:00",
        "total": "10.00",
        "status": "Paid",
        "paymentmethod": "stripe",
        "currencycode": "USD"
      }
    ]
  }
}
